Revit 2024 API
Metal.MetalColor Property
 The property labeled "Color" from the "Metal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string MetalColor { get; }
Visual Basic
Public Shared ReadOnly Property MetalColor As String
	Get
Visual C++
public:
static property String^ MetalColor {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Metal Class
Autodesk.Revit.DB.Visual Namespace